-----------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\zhan2\Dropbox\Class\ACG5906\assignment\ACG5906_assignment_1\assignment1.log
  log type:  text
 opened on:   3 Oct 2024, 21:53:58

. 
. import delimited "dataset_nobel_chocolate-1.csv", clear
(encoding automatically selected: ISO-8859-1)
(3 vars, 23 obs)

. compress
  (0 bytes saved)

. save "dataset_nobel_chocolate.dta", replace
file dataset_nobel_chocolate.dta saved

. 
. *describe
. *codebook
. 
. * ssc install outreg2, replace
. * ssc install asdoc, replace
. * ssc install cortex, replace
. 
. outreg2 using p1.tex, replace sum(log) ti(Table 1: Summary Statistics)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       nobel |         23    11.08878    10.21818        .05     31.855
   chocolate |         23    5.732174    3.065251         .8      11.53

Following variable is string, not included:  
name  
p1.tex
dir : seeout

. 
. set graphics off

. #delimit ;
delimiter now ;
. twoway scatter nobel chocolate, 
>         mlabel(name) 
>         title("Nobel Laureates vs. Chocolate Consumption") 
>         xtitle("Chocolate Consumption (kg per capita per year)") 
>         ytitle("Nobel Laureates per 10 Million Population") 
>         xlabel(0(5)15) 
>         ylabel(0(5)30)|| 
>         lfit nobel chocolate;

. #delimit cr
delimiter now cr
. 
. graph export "fig1.png", replace
(file fig1.png not found)
file fig1.png saved as PNG format

. 
. corrtex nobel chocolate, file(p3a) sig title(Correlation Table) replace
(file p3a.tex not found)


\begin{table}[htbp]\centering \caption{Correlation Table\label{corrtable}}
\begin{tabular}{l  c  c }\hline\hline
\multicolumn{1}{c}{Variables} &nobel&chocolate\\ \hline
nobel&1.000\\
 &\\
chocolate&0.791&1.000\\
&(0.000)\\
\hline \hline 
 \end{tabular}
\end{table}

 Output writted successfully in file : p3a.tex

. 
. corrtex nobel chocolate if name != "Sweden", file(p3b) sig title(Correlation Excluding Sweden) replace
(file p3b.tex not found)


\begin{table}[htbp]\centering \caption{Correlation Excluding Sweden\label{corrtable}}
\begin{tabular}{l  c  c }\hline\hline
\multicolumn{1}{c}{Variables} &nobel&chocolate\\ \hline
nobel&1.000\\
 &\\
chocolate&0.862&1.000\\
&(0.000)\\
\hline \hline 
 \end{tabular}
\end{table}

 Output writted successfully in file : p3b.tex

. 
. reg nobel chocolate

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(1, 21)        =     35.14
       Model |  1437.79331         1  1437.79331   Prob > F        =    0.0000
    Residual |  859.253513        21   40.916834   R-squared       =    0.6259
-------------+----------------------------------   Adj R-squared   =    0.6081
       Total |  2297.04683        22  104.411219   Root MSE        =    6.3966

------------------------------------------------------------------------------
       nobel | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   chocolate |   2.637369   .4449115     5.93   0.000     1.712125    3.562613
       _cons |  -4.029074   2.878033    -1.40   0.176    -10.01427    1.956124
------------------------------------------------------------------------------

. outreg2 using p3c.tex, label ctitle(Model 1) replace
p3c.tex
dir : seeout

. 
. scalar beta_inv = 1/_b[chocolate]

. di "Total kg of chocolate needed for the US: " beta_inv * 330
Total kg of chocolate needed for the US: 125.12471

. 
. reg nobel chocolate if name != "Sweden"

      Source |       SS           df       MS      Number of obs   =        22
-------------+----------------------------------   F(1, 20)        =     57.97
       Model |  1372.62919         1  1372.62919   Prob > F        =    0.0000
    Residual |  473.580252        20  23.6790126   R-squared       =    0.7435
-------------+----------------------------------   Adj R-squared   =    0.7307
       Total |  1846.20944        21  87.9147351   Root MSE        =    4.8661

------------------------------------------------------------------------------
       nobel | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   chocolate |   2.579242    .338764     7.61   0.000     1.872593    3.285892
       _cons |  -4.569713   2.193502    -2.08   0.050    -9.145277    .0058518
------------------------------------------------------------------------------

. outreg2 using p5c.tex, replace
p5c.tex
dir : seeout

. 
. use "dataset_nobel_chocolate_extended-1.dta", replace

. replace name = substr(name, 2, .)
(23 real changes made)

. replace name=subinstr(name," ","",.)
(2 real changes made)

. save "dataset_nobel_chocolate_extended_cleaned.dta", replace
file dataset_nobel_chocolate_extended_cleaned.dta saved

. 
. use "dataset_nobel_chocolate.dta", replace

. merge 1:1 name using "dataset_nobel_chocolate_extended_cleaned.dta"
(variable name was str13, now str15 to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                23  (_merge==3)
    -----------------------------------------

. 
. save "dataset_nobel_chocolate_extended_cleaned_merged.dta", replace
file dataset_nobel_chocolate_extended_cleaned_merged.dta saved

. 
. reg nobel chocolate gdp hdi energy protein life

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(6, 16)        =      7.88
       Model |  1716.50087         6  286.083478   Prob > F        =    0.0005
    Residual |  580.545959        16  36.2841225   R-squared       =    0.7473
-------------+----------------------------------   Adj R-squared   =    0.6525
       Total |  2297.04683        22  104.411219   Root MSE        =    6.0236

------------------------------------------------------------------------------
       nobel | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   chocolate |   1.997607   .6024868     3.32   0.004     .7203921    3.274822
         gdp |   .0003166   .0001254     2.52   0.023     .0000508    .0005825
         hdi |  -69.06868    49.3553    -1.40   0.181    -173.6972    35.55989
      energy |  -.0038526   .0064507    -0.60   0.559    -.0175274    .0098223
     protein |   .2170391   .2116425     1.03   0.320    -.2316229    .6657011
        life |  -.1013553   .7379593    -0.14   0.892    -1.665759    1.463049
       _cons |   44.23086   51.29147     0.86   0.401     -64.5022    152.9639
------------------------------------------------------------------------------

. outreg2 using p8a.tex, replace
p8a.tex
dir : seeout

. 
. corrtex nobel chocolate gdp hdi energy protein life, file(p8b) sig replace
(file p8b.tex not found)


\begin{table}[htbp]\centering \caption{Cross-correlation table\label{corrtable}}
\begin{tabular}{l  c  c  c  c  c  c  c }\hline\hline
\multicolumn{1}{c}{Variables} &nobel&chocolate&gdp&hdi&energy&protein&life\\ \hline
nobel&1.000\\
 &\\
chocolate&0.791&1.000\\
&(0.000) &\\
gdp&0.726&0.656&1.000\\
&(0.000)&(0.001) &\\
hdi&0.489&0.533&0.808&1.000\\
&(0.018)&(0.009)&(0.000) &\\
energy&0.099&0.255&0.028&0.157&1.000\\
&(0.655)&(0.240)&(0.900)&(0.474) &\\
protein&0.088&0.080&0.166&0.482&0.466&1.000\\
&(0.689)&(0.716)&(0.449)&(0.020)&(0.025) &\\
life&0.275&0.285&0.544&0.705&0.006&0.365&1.000\\
&(0.204)&(0.187)&(0.007)&(0.000)&(0.978)&(0.087)\\
\hline \hline 
 \end{tabular}
\end{table}

 Output writted successfully in file : p8b.tex

. 
. reg nobel chocolate gdp hdi

      Source |       SS           df       MS      Number of obs   =        23
-------------+----------------------------------   F(3, 19)        =     17.15
       Model |  1677.67535         3  559.225117   Prob > F        =    0.0000
    Residual |  619.371475        19  32.5984987   R-squared       =    0.7304
-------------+----------------------------------   Adj R-squared   =    0.6878
       Total |  2297.04683        22  104.411219   Root MSE        =    5.7095

------------------------------------------------------------------------------
       nobel | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   chocolate |   1.845605   .5260162     3.51   0.002     .7446405     2.94657
         gdp |   .0002871   .0001092     2.63   0.017     .0000586    .0005157
         hdi |  -47.46361   33.34428    -1.42   0.171     -117.254    22.32677
       _cons |   29.05091   25.71807     1.13   0.273    -24.77763    82.87945
------------------------------------------------------------------------------

. outreg2 using p8c.tex, replace
p8c.tex
dir : seeout

. 
. cap log close
